onec/omni/src/extension/бит_МедицинаОмни_ПРОФ/Catalogs/бит_омни_ШаблоныСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_омни_ШаблоныСообщений</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ШаблонСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантФормата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПоляШаблона</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Поле</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АлгоритмРасчета</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

onec/omni/src/extension/бит_МедицинаОмни_ПРОФ/Catalogs/бит_омни_ШаблоныСообщений/Ext/ManagerModule.bsl
Функция СформироватьТекстСообщенияПоШаблону(Шаблон, Получатель, Контекст) Экспорт
	
	ТекстСообщения = Шаблон.ШаблонСообщения;
	НачалоБлока = ?(Шаблон.ВариантФормата = "HTML", "{{ ", "<");
	КонецБлока = ?(Шаблон.ВариантФормата = "HTML", " }}", ">"); 
	
	Для Каждого ПолеШаблона Из Шаблон.ПоляШаблона Цикл
		Поле = НачалоБлока + ПолеШаблона.Поле + КонецБлока;
		Результат = "";
		Выполнить(ПолеШаблона.АлгоритмРасчета);
		ТекстСообщения = СтрЗаменить(ТекстСообщения, Поле, Результат);
	КонецЦикла;
	
	Возврат ТекстСообщения;
	
КонецФункции
